NACA0012_AoA5/constant/transportProperties
version https://git-lfs.github.com/spec/v1
oid sha256:c3020496cd3afda02b856c2d365d3f979ad4af786dad913bf11e5517013f3494
size 900
