NACA0012_AoA5/constant/turbulenceProperties
version https://git-lfs.github.com/spec/v1
oid sha256:553b89906ee76ba4d4adaea9ab0317b2d035b9aa623c16708bdfcdeb169c2ce0
size 987
